[{"slug":"2023-01-06","title":"邪悪なフリクリ！","content":"\n\n# やったこと\n\n- フリクリ見る\n- 編入数学 3 章\n- ブログに NIPPO 追加\n\n## フリクリ\n\nついにフリクリを見た！タツキ先生がチェンソーマンについて「邪悪なフリクリ」と言っていたので気になっていたのだが長らく見れていなかった。コミカルな内容とぶっ飛んだ展開とヒロイン、なるほどこれは「ポップなチェンソーマン」だって感じだった。チェンソーマンの Easy revenge タバコの元ネタもフリクリの印象的なシーンとして使われていて興奮した。また最後まで見て大筋のストーリーもかなり似ているのが分かってかなり面白かった。合わせて[このブログ](https://note.com/take_hide/n/na2fbbb15001d)も読みたい。チェンソーマンの話を抜きにしてもカメラの動きやキャラクターの動きが斬新で面白いし、裏で流れている音楽も the pillows というバンドを起用しているらしくゴリゴリのロックって感じで楽しい。今度は鶴巻監督のトップを狙えを見たい。あと JIN-ROH も。\n\n## 編入数学 3 章\n\n広義積分の収束判定が難しい。どうやら収束判定法がいくつかあるらしくどれを使えばよいかがあまり分かっていない。追々定義を確認していきたい。ベータ関数！ガンマ関数！\n\n## ブログに NIPPO 追加\n\n友達が羨ましくて始めた。今あるブログにちょいと変更を加えるだけだったので楽に追加できて良かった（リファクタしたい）。NIPPO の響きが良すぎて気持ち悪い URL や命名になってるけど NIPPO だから許されるはず。映画や本の感想を投稿できるのは楽しい。ついでに[2022 振り返り](https://dz99.me/article/look-back-2022)も書いた。\n\n# 思ったこと\n\nTOEIC のアプリをやりたい。星を継ぐもの読み切りたい。\n"},{"slug":"2023-01-07","title":"もう少しで冬休みが終わる。頼むからあと3日追加してくれ。","content":"\n\n# やったこと\n\n- ブログ OGP 画像を動的に生成\n- 編入数学 3-7 章\n- コンピュータ工学課題\n\n## ブログ OGP 画像を動的に生成\n\nずっとやろうと思っていて後回しになっていた OGP 画像の動的生成をやった。ishibe-chan に教えてもらった@vercel/og を使った。画像を確認しながら開発できたのは良かったが、CSS 弱者としてはデベロッパーツールで Element を確認しながらやりたかった。完成したのはかなり Zenn 亜種ぽくなってしまったけど満足。コードは div だけで構成したり、border のグラデーション表現で background グラデーションを子で上書きすることで実現したりと筋肉コードがあるのでぼちぼち修正したい。\n\n## 編入数学 3-7\n\nなきなき\n\n## コンピュータ工学課題\n\n明日やりたい\n\n# 思ったこと\n\n課題やりたい。イーストウッド映画みたい。\n"},{"slug":"2023-01-08","title":"今はなき遠い故郷へ","content":"\n\n# やったこと\n\n- 人狼 JIN-ROH を見る\n- 星を継ぐものを読む\n\n## 人狼 JIN-ROH を見る\n\nチェンソーマンのレぜ編に影響している作品ということで見た。まさに色濃く影響を与えている作品といった感じで構成が似ていて感動した。改めて人狼とレゼ編を見ると、どちらも「二人で逃げる」くだりがさらに劇的なる。こうした素晴らしい創作アイディアが受け継がれているのを感じると感慨深いものがある :)\n\n## 星を継ぐものを読む\n\n初の SF 小説を読んだ。SF というとスターウォーズを想像するが、この作品はもっと科学や技術に忠実だった。もちろんフィクションなんだけど想像の範囲内というか、「もしかしたらあるかも」というワクワク感を与えてくれる。宇宙服を着た 5 万年前の人類のような生物の謎を解くという内容で、謎が謎を呼んでどんどんと新しい情報と仮説が出て、世界が広がっていく。宇宙への渇望と先祖への感謝感謝が止まらない！\n\n# 思ったこと\n\n家の近くの TSUTAYA がなくなることを知り、ソフトウェアの力を感じた。馴染み深い場所がなくなることは寂しい。日報をスマホで書きたいので、いい感じの仕組みを考えたい。Web で書いて md ファイルをパブリッシュするような？\n"},{"slug":"2023-01-09","title":"ぼざろ8話と12話を見て泣く毎日","content":"\n\n# やったこと\n\n- コンピュータアーキテクチャ課題\n- 解析学課題\n- にんじん読み始め\n\n## コンピュータアーキテクチャ課題\n\n溜まっていた 3 つの課題をやっつけた。正直一気に 3 つはきついので毎週しっかりやっていきたい。うん、当たり前すぎることを言っている。\n\n## 解析学課題\n\nこれからやります :\\_(\n\n## にんじん読み始め\n\nジャンプラで漫 ☆ 画太郎先生が連載中の[漫古 ☆ 知新-バカでも読める古典文学-](https://shonenjumpplus.com/episode/316190247017199335)で題材になっていた本だ。漫 ☆ 画太郎先生のこの漫画は古い本をコミカルに解釈して読んでみようという作品で面白おかしく読めるのだが、題材となっている作品自体はかなりシリアスなものらしいので気になった。また読了後に感想を書きたい。\n\n# 思ったこと\n\n明日から学校なんて信じられない。それでも頑張ろう！\n"},{"slug":"2023-01-10","title":"Never knows best","content":"\n\n# やったこと\n\n- 解析学課題\n- 編入数学\n- 水星の魔女見る\n\n## 解析学課題\n\n重積分は思ったより今までの積み重ね感がある。授業はちゃんと受けよう！\n\n## 編入数学\n\n3 章最後の単元と 4 章の途中まで。定積分と漸化式の範囲は思ったよりできそう。Photomath で解けない問題を人間の脳みそで解くとちょっとうれしい。4 章の定積分を使った面積と体積の計算は意外と覚えてなくて困った。ちゃんと慣れていきたい :)\n\n## 水星の魔女\n\n正月を挟んでやっと 12 話が放映された。最近の水星の魔女は刺激的だったが、1 期の最後ということもあってそれが最高潮に達していた。今まではスレッタの母親の異常性が垣間見えるシーンが多かったが、12 話にしてスレッタの異常性が浮き彫りになった。2 期は 4 月から放映らしいが気になりすぎる。\n\n# 思ったこと\n\n学校があると休みのときより時間をコントロールしやすくなるので良い！早起きが強制されるから？編入勉強を図書館で出来るから？\n"},{"slug":"2023-01-11","title":"スマホで日報を書きたい！","content":"\n\n# やったこと\n\n- スマホで日報やるための調査\n- 茶道\n- 編入数学\n\n## スマホ日報\n\nかねてからスマホで日報を書きたいと思っていて、なんとなく構成を考えていた。Web のエディタで書いてオンラインストレージに md ファイルをポストするようなものを考えていたが、naka-chan に Notion API 使えばいいじゃんと言われて調べてみるとやりたいことが全部満たされていた。1.Notion で記事を書く。2.Notion 記事フェッチ&Markdown ファイル作成。3.変更を見てプルリクを投げる。1~3 のフローで 2,3 はサーバのジョブとして定期実行したい。こんな感じで計画を立てつつ、NotionAPI を叩いたりしていた。\n\n## 茶道\n\n久々のお濃茶のお点前で全然覚えてなくて辛かった。お濃茶は薄茶と違って、一つ一つの所作が重たい＆細かい所作が多いので覚えにくい。お茶会練習がすぐあるので急ピッチでやっていきたい。\n\n## 編入数学\n\n全然できなかった。\n\n# 思ったこと\n\n明日はいい授業\n"},{"slug":"2023-01-12","title":"時間コントロールむずい","content":"\n\n# やったこと\n\n- スマホ日報開発\n- TS パーサコンビネータ\n- 編入数学\n\n## スマホ日報\n\n開発を始めた。とりあえず notion API を使って記事データをフェッチしてファイル作成するとこまでやったので、サーバのジョブとして定期実行させてプルリクを投げるようにしたい。次回で終わらせたいけど actions の知識などがないから時間がかかりそうではある。\n\n## 編入数学\n\n長かった 4 章を抜けて 5 章へ。5 章は級数の範囲だが、結構重たい。無限級数の総和で等比数列を使う問題を解いていて、数列が弱いと感じたので重点的にやっていきたい。\n\n# 思ったこと\n\n本を読みたいんだよぉ\n"},{"slug":"2023-01-13","title":"脊髄剣","content":"\n\n# やったこと\n\n- 新年会第二弾\n- スマホ日報開発\n- チェンソーマン\n\n## 新年会第二弾\n\n新年会第一弾に参加できなかったメンバーを交えて第二弾が開催された。このメンバーたちともうすぐ離れ離れになって、こうして集まるのが難しくなるのは悲しい。一回一回を大事にしたい。\n\n## スマホ日報\n\n新年会が終わったあと actions を書いていたが、いつの間にか寝ていた。今日やろうと思う\n\n# 思ったこと\n\nみんなで集まってあれやこれやと話すのはやっぱり楽しい\n"},{"slug":"2023-01-14","title":"久々にいいもの作った気分","content":"\n\n# やったこと\n\n- スマホ日報開発\n- ストレージ容量を調べる\n- リリイ・シュシュのすべてを見る\n\n## スマホ日報開発\n\n\nGithub Actionsについて適当にやっていたところをちゃんと理解しながら書けて良かった。今もNotion(スマホではない)で書いてやす！\n\n\n## ストレージ容量\n\n\nノートパソコンでストレージ容量を調べずに[大失敗した](https://dz99.me/article/system-replacement-and-notice)経験があったので、デスクトップの容量内訳を調べた。fuki-nonがちょっと前にいいヴィジュアライザーがあると教えてくれたので、[適当なソフト](https://github.com/bexxmodd/vizex)を探してみた。確認してみると var ディレクトリ40GiBほど占領していて、そのほとんどがpacmanでインストールしていたパッケージのキャッシュだった。\n\n\n## リリイ・シュシュのすべて\n\n\n切ない。中学生たちの苦悩と非行を描いた作品。悩みを上手く吐き出せない中学生たちの叫び。最初の牧歌的な日常シーンと残酷な非行のシーン(街録チャンネルの世界観)のギャップに圧倒された。全編に渡って流れるクラシックと映像が妙に合っている。リリイ(悩める人の支えとなっているシンガー)掲示板に関して主人公と裏主人公のミスリードには胸がキュッとなった。岩井監督の作品でスワロウテイルを見ていて、あれは世界観こそ哀愁を感じるが、キャラクターや内容は明るい感じだった。けどこの作品は本当に暗いし、救いがない。今度は平和な映画を見たいな。\n\n\n# 思ったこと\n\n\n明日はTSUTAYAに行くぞ\n\n"},{"slug":"2023-01-15","title":"メトロポリス","content":"\n\n# やったこと\n\n- 課題\n- TSUTAYA行く\n\n## 課題\n\n\nコンアキと通信工学をやっつけた。正直もっと出来たと思うけど、今日は虚無だったから仕方なし\n\n\n## TSUTAYA\n\n\n車に乗らないとバッテリーがあがってまずいらしいので、TSUTAYA行きを週一でやっている。今回は先週借りたDVDを返しに行った。このTSUTAYAは今日で閉店だ。なんだか悲しい。\n\n\n# 思ったこと\n\n\n成人式のためのスーツを眺めたり、調べたりしていると生地の種類が見つかって楽しい。\n\n"},{"slug":"2023-01-16","title":"分人！最高！分人！最高！","content":"\n\n# やったこと\n\n- 国語の分人\n- 編入数学\n\n## 分人\n\n\n国語の授業で『**私とは何か　「個人」から「分人」へ**』の一部を読んだ。これのおかげで、たまに悩むことが少し解決した。本当の自分はどれかということをたまに考える。高専の友達と接してる時と家族と接してる時、地元の友達と接してる時、blogを書いてる時と結構違う顔を持っていると思っていた。これのよくないところは本当の自分を定義づけてしまうことだ。それによってこの人たちの前では素で、この人たちの前では仮面を被ってる、果ては誰も本当の自分を知らないという感覚に陥る。誰と接していても楽しいのだけど、たまーに違和感。今回の授業の本はその違和感を解消してくれた。分人という新しい概念は、一つ一つの顔を別の人間だと認めた上でどれも本当の自分であるとする。分人大きさによって、別の分人に与える影響も変わってくる。それによって本当の自分という幻想が揺らぐのだ。自分をこの解釈で見てあげると、今までの悩みが瑣末になった。感謝。平野啓一郎の小説も読みたい。\n\n\n## 編入数学\n\n\n5章の半分まで。級数の収束発散判定はかなり出来て嬉しい。これから終わらせたい:-)\n\n\n# 思ったこと\n\n\nやりたいこと多いぜ\n\n"},{"slug":"2023-01-17","title":"すべてのエンタメに感謝","content":"\n\n# やったこと\n\n- 編入数学\n- コンアキ\n- Samansa登録\n\n## 編入数学\n\n\n5章の途中から6章の途中まで。マクローリン展開の無限等比級数を利用する問題がよく分からなかった。6章の偏微分は最近やったこともあって、今のところは順調。今週解析の部分を全部終わらせたかったけど難しそう。\n\n\n## コンアキ\n\n\n改めて勉強してみると、ちゃんと理解してなかったところが出てくるからいい感じ。ワードアドレスからバイトアドレスへの変換のくだりとか全然覚えてなくて焦った。\n\n\n## Samansa\n\n\nYoutubeのショートでたまーに流れてくる短編映画サブスク。映画賞を取ってるような作品も扱ってるらしく、実際作品のクオリティが高い(一本しか見てない)。一本あたり5~20分程度なので、勉強の合間とかに見ていきたい:)\n\n\n# 思ったこと\n\n\nなめだるまの新曲が良かった！\n\n"},{"slug":"2023-01-18","title":"課題に殺された","content":"\n\n# やったこと\n\n- サンダー3 第2巻\n- ソフトウェア設計課題\n\n## サンダー3 第2巻\n\n\n今イチオシの漫画！最近2巻が出たばかりの新しい漫画だ。コアのアイディアが面白く刺さった。漫画世界と現実世界の融合が絵としてうまーく表現できており、ストーリーはシンプルで入ってきやすい。今後の展開が気になる作品だ :-)\n\n\n## ソフトウェア設計課題\n\n\n謎の課題に時間を食べられた。\n\n\n# 思ったこと\n\n\n編入数学は毎日やりたいけど課題に殺されることもある。\n\n"},{"slug":"2023-01-19","title":"いつかの空想","content":"\n\n# やったこと\n\n- ゼミ\n- ジャンプラ読み切り読む\n\n## ゼミ\n\n\nNo Secure Cookie環境で中間者攻撃をしてCookieを読もうとして上手くいかない。ettercapを使って実施しているが、どうやら[OSPF](https://github.com/Ettercap/ettercap/issues/773)が悪さをしていそう。OSPF Poisningという攻撃もあるらしいが、今回はそこまでやるのは大変そうなので、ミニマルなネットワーク環境を構築することとする\n\n\n## ジャンプラ読み切り\n\n\n久しぶりに気に入る作品を読んだ。[さいごの宇宙船](https://shonenjumpplus.com/episode/316190247098378462)だ。世界観や結末は、オカルト番組を見た夜の日の妄想に似ていて懐かしくなった。\n\n\n# 思ったこと\n\n\n本を読みたい\n\n"},{"slug":"2023-01-20","title":"Linusと2Bに捧ぐ","content":"\n\n# やったこと\n\n- 去年の冬、きみと別れを読む\n- 編入数学\n- HOTEL 22を観る\n\n## 去年の冬、きみと別れを読む\n\n\n※ネタバレも含みます。見ないでください\n\n\nnaka-chan から借りた本を読んだ。不思議な雰囲気と陰鬱な雰囲気が続く中で、少しずつ違和感を感じつつも狂気の内容に惹き込まれた。タイトル回収時点では、こんなところに事件の真相があったかと驚いた。しかしそれ以上の仰天がやってきた！最後、今まさに手の中にある「小説」がこの物語を構成してると思いゾクゾクした。どうやらこの作品は映画化されているらしいが、これを映画化するための壁は高いはずだ。\n\n\n## 編入数学\n\n\n6章の途中まで。偏微分の範囲は他より長くて大変:( 土日で解析範囲を終わらせたいので明日は重積分までいく。\n\n\n## HOTEL 22\n\n\n勉強の合間に観たショートドキュメンタリー。シリコンバレーには24時間運行しているバスがあって、そこで寝泊まりしているホームレスのドキュメンタリー。シリコンバレーは煌びやかなイメージがあるが、現実は結構残酷。名古屋のホームレス事件のこともあり、見ていて苦しいものがあった。\n\n\n# 思ったこと\n\n\n200pくらいの小説っていいな。短い時間で読める :-) \n\n"},{"slug":"2023-01-21","title":"カトマンズの男","content":"\n\n# やったこと\n\n- 編入数学\n- ジョン・ウィック観る\n- Samansa何本か\n\n## 編入数学\n\n\n6章、偏微分の範囲はこれで終わり。7章の途中までやっときたかったけど、偏微分が長かった…\n\n\n## ジョン・ウィック\n\n\n久しぶりのアクション映画。キアヌはマトリックスのイメージが強いけど、個人的にこの映画の方がかっこよかった。クラブでの戦闘シーンの音ハメには体が動いてしまった。キャラクターのスーツやトレンチコートのスタイルがスタイリッシュで憧れる！\n\n\n## Samansa\n\n\n2本観た。その中のカトマンズの男という作品が良かった。悩みを抱えた男がネパールに行って悩みを解決するというシンプルなロードムービー。10分と少ししかない時間で、旅の中で変わっていく男の姿とネパールの人たちの温かさにほっこりする。ショート映画にはショート映画の良さがある。\n\n\n# 思ったこと\n\n\n明日は課題とゼミもやないとなー\n\n"},{"slug":"2023-01-22","title":"はやくジャンプ読みてー","content":"\n\n# やったこと\n\n- 課題\n\t- 英語\n\t- 経済(枠組み)\n\n# 思ったこと\n\n\n最近のジャンプは合併号と正月で更新されていなかったが、ついに明日(今日)新刊が発売される！嬉しい\n\n"},{"slug":"2023-01-23","title":"がらんどう","content":"\n\n# やったこと\n\n- 編入数学\n- プログラミングHaskell\n- STAPS\n\n## 編入数学\n\n\n第7章突入！重積分は現在進行形で授業を受けているので復習になっていい感じ。ヤコビアンを使うとこまでやったので、明日は7章を終わらせたい。\n\n\n## プログラミングHaskell\n\n\n編入勉強の合間に本を読みたいと思った。On LispとプログラミングHaskellと迷ったが、周りが関数型言語の話題でもちきりなので、その波に乗ろうと思う。\n\n\n## STAPS\n\n\nロジカルシンキングの手法を使うことが目的となってしまい、うまく使いこなせなかった。いいレビューをもらえたので改善していく。\n\n\n# 思ったこと\n\n\nジャンプの発売日なのに読めなかった。積読しないようにちょいちょい読んでいきたい :-)\n\n"},{"slug":"2023-01-24","title":"両立螺旋","content":"\n\n# やったこと\n\n- 編入数学\n- ジャンプ読む\n- ゼミ\n\n## 編入数学\n\n\n重積分の範囲が終わり。3重積分をやっているときに、2重積分と中身は大体一緒なんだと気づけて良かった。ただ体積問題があんまり理解できていないので、定義からしっかり理解したい。\n\n\n## ジャンプ\n\n\nヒロアカを読みながら泣いてしまった。ヴィランの原点も人を助けたいというところから来てるんだなと。\n\n\n## ゼミ\n\n\nこれから :(\n\n\n# 思ったこと\n\n\n編入勉強を続けることが当たり前になってきた。けど最近は早くやろう、終わらせようと思って理解が追いつかないまま進んでいる節もあるので気をつけたい。\n\n"},{"slug":"2023-01-25","title":"数学ランド","content":"\n\n# やったこと\n\n- プログラミングHaskell 1章読む\n- STAPS\n- ソフトウェア設計課題\n- 編入数学\n\n## プログラミングHaskell 1章\n\n\nHaskellといえば、”Land of Lisp”でちょっとしたネタにされている言語というイメージしかなく、関数型言語というものが何かを理解したことはなかった。この本を読むと、関数型言語とはという問いに答えを出すことができるようになるかもしれない。Haskellの世界では全てのプログラムが数学のように定義され、それが世界を形にしていく。クイックソートの紹介が特に衝撃的だった。クイックソートといえば、アルゴリズムの授業で言葉ではよく分かるんだけど、Cのコードは結構分かりにくいよなーと思っていた。それがHaskellでは言葉通りに記述することができる。さらにそれが強力な型システムによってより厳密に安全に定義される。数学ランドは楽園だったのか。\n\n\n## 編入数学\n\n\n久々の微分方程式、がんばるぞー！\n\n\n# 思ったこと\n\n\nプログラミングHaskellの練習問題、ソースコードはあっているのにパターンが網羅されていないと怒られる。Foldable型クラスが悪さしてる？\n\n"},{"slug":"2023-01-26","title":"Death man","content":"\n\n# やったこと\n\n- 編入数学\n- STAPS\n- プログラミングHaskell 2章\n- 死神\n\n## 編入数学\n\n\nあんまり進められなかった。明日は8章が終わるようにやっていきたい。\n\n\n## STAPS\n\n\n面接。あの反応は通っているだろう。\n\n\n## プログラミングHaskell 2章\n\n\n組み込み関数のことをPreludeというらしい。初めて知った。\n\n\n## 死神\n\n\nSamansaの作品。死神というよりも死体処理の人って感じがしたので、エンドロールの役名を見たら「Death man」だったので死神で合ってるんだと思う。死神の仕事をずっとしているのに人間の死体を見たら吐き気を催していて、なんだか人間らしいなと思った。辛そうだけど仕事として割り切っているのだろうか。\n\n\n# 思ったこと\n\n"},{"slug":"2023-01-27","title":"Dear ニック","content":"\n\n# やったこと\n\n- 編入数学\n\n## 編入数学\n\n\n微分方程式終わり！重積分や級数に比べるとスムーズに進めることができた。ここからは線形代数の範囲。とりあえず徹底研究を継続させつつ、マセマで補っていきたい。\n\n\n# 思ったこと\n\n\nスタプラには勉強時間に対してのいいね機能がある。TOEICをやっていたときは、ニックという誰かも分からない人に毎回いいねされていて、意外にもそれがモチベーションの一つになっていた。しかし、数学の勉強をしていてもニックはいいねをくれなかった。当たり前だ。ニックは英語学習の人だから。けどある時、徹底研究の勉強に対してニックからいいねが来た。特に意味はないだろうが、「見てるぞ」と言われた気がして嬉しくなった。\n\n"},{"slug":"2023-01-28","title":"初炭","content":"\n\n# やったこと\n\n- 茶道練習\n- プログラミングHaskell 3章\n\n## 茶道練習\n\n\nお茶会に向けて約6時間の練習。かなり大変だったが、普段なかなかできない稽古をして、実際の茶会の流れを掴むことができて良かった。特に炭の稽古はやれる機会がないので、しっかり流れをメモして復習したい。\n\n\n## プログラミングHaskell 3章\n\n\n型の話。型クラスという概念が面白かった。型をある性質を持つ値の集合の値として、型クラスはある性質を持つ型の集合としていたのは腑に落ちた。型と型クラスは制限を与える。\n\n\n# 思ったこと\n\n\n5年間も真面目に茶道やっていて、高専卒業後にはきっぱりとやめちゃうのは勿体ないなと思った。かといって続けるのも難しいと思う。\n\n"},{"slug":"2023-01-29","title":"car","content":"\n\n# やったこと\n\n- プログラミングHaskell 4章\n- 課題\n\t- 経済\n\t- 国語\n- 硫黄島戦映画を見た\n\n## プログラミングHaskell 4章\n\n\n関数の定義の章。いわゆる数学的な式の定義を書き連ねて、正しい動作がなされる裏側には強力なパターンマッチングがあるのだと分かった。またラムダ式で関数を定義すると、より形式的に関数を眺めることができる（型定義により近い）。あとリストを構成するための演算子でconsの話が出たのは面白かった。Lispの概念が直接使われているし、(x:xs)の意味をcar,cdr的に理解できて良かった。\n\n\n## 硫黄島\n\n\nクリントの硫黄島映画、「父親たちの星条旗」と「硫黄島からの手紙」を見た。二本立て続けに見ることで戦争中の二つの国の視点を認識することができた。父親たちの星条旗は戦争の話というより、戦争が終わったあとに英雄として扱われた男たちの話。硫黄島で星条旗を掲げ生き残った人間は、軍事資金繰りのために英雄として祭り上げられ、しかし自分たちは何もやっていないという思いのギャップに苦しむ。本当は普通の若者で国のためではなく、一緒に戦争に行った仲間たちのために戦っていた。硫黄島からの手紙は、硫黄島戦を日本側の視点から描く。父親たちの星条旗では日本兵のことを、捕虜を残虐に殺したり、集団自決したりする狂気的な人間のように見せている。しかし、実際は見え方の問題だと描く。戦争に行きたくないと思っている人もいるし、捕虜に対して優しく接する人もいる。集団自決も覚悟の上のこと。日本人もアメリカ人も本質はあまり変わらないように思えた。あと栗林中将がかっこいい。アメリカとは戦いたくないと言いつつも、いざ戦争となると、自分と国の信念が同じとして国のために戦う。並大抵の人間ができることじゃない。クリント映画はおじいちゃん系しか見たことなかったが、この二作品は随分毛色が違った。時間は溶けたが良かった。\n\n\n# 思ったこと\n\n\n編入数学をやろう\n\n"},{"slug":"2023-01-30","title":"予は常に諸氏の先頭にあり","content":"\n\n# やったこと\n\n- 課題\n\t- 数学\n- STAPS\n\n# 思ったこと\n\n\nnippoの更新をSlackに通知したい。\n\n"},{"slug":"2023-01-31","title":"500km","content":"\n\n# やったこと\n\n- ストレイトストーリーを見る\n- 課題\n\t- コンアキ\n\n## ストレイトストーリー\n\n\nデイヴィッド・リンチの作品。イレイザーヘッドやエレファントマンといった作品を見ていたので、ほっこりロードムービーを作っていることに驚いた。70歳のじいちゃんがお兄ちゃんに会いに、トラクターで500kmを旅する話。旅の中で出会う温かい人たちと寛大なおじいちゃんの掛け合いは、みていて心が洗われる。兄弟はいくら仲違いしても最後は引き合ってしまう。10年以上も会っていないのに、声を聞いただけで弟がやってきたと分かるのに感動してしまった。牧歌的で爽快なとてもいい作品だった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-01","title":"論理型言語むつかしい","content":"\n\n# やったこと\n\n- 編入数学\n- 課題\n\t- コンアキ\n\t- ソフトウェア設計\n- プログラミングHaskell 5章\n\n## プログラミングHaskell 5章\n\n\nリスト内包表記の章。数学の集合みたいな感じで分かりやすい。Pythonでやったのよりもより直感的で意図が伝わりやすい。シーザー暗号をリスト内包表記でやったり、頻度分析も簡単にできたりして面白かった。\n\n\n# 思ったこと\n\n\nプロ言のProlog、SLD導出がよくわかっていない。なんとなく掴めた気がしたが、導出は分からず。\n\n"},{"slug":"2023-02-02","title":"Hello abroad","content":"\n\n# やったこと\n\n- 編入数学\n- プログラミングHaskell 6章\n- AURメンテ\n\n## 編入数学\n\n\n9章最後まで。本当は10章の途中までやる予定だったが、AURメンテに思ったよりも時間が取られてしまった。\n\n\n## プログラミングHaskell 6章\n\n\n再帰関数の章。練習問題をやれていないのでやりたい。\n\n\n## AURメンテ\n\n\n突然見覚えのない人からメールが来た。内容も英語だし、何だろうと思ったら管理しているAURの利用者の人だった。パッケージが更新されてないから更新してほしいとのこと。すぐに作業にとりかかったが、ビルドの手順が微妙に変わっていて少し手間取った。更新を忘れないようにGitHubのリリースを通知するようにした。更新フローをactionsとかで自動化したいな。今回のような修正でなければいけそう。\n\n\n# 思ったこと\n\n\n外国の人から英語でのメール。しびれるぜ\n\n"},{"slug":"2023-02-03","title":"Last シャトル","content":"\n\n# やったこと\n\n- 編入数学\n\n## 編入数学\n\n\n10章の最後まで。余因子展開の応用問題あたりがよく分からなかったので解消したい。ここからはマセマを読みながら線形代数の勉強を進めていく。\n\n\n# 思ったこと\n\n\n本読みたい\n\n"},{"slug":"2023-02-04","title":"後炭","content":"\n\n# やったこと\n\n- 茶会練習\n\n## 茶会練習\n\n\n今週は炭直しのお点前の練習をやった。初炭よりは工程が少なくて簡単だと感じた。初炭と同じ部分は頭に入っているからそう感じるのかもしれない。中掃きや水を注ぐ工程など初炭と違う点もあるので、しっかり区別して覚える。\n\n\n# 思ったこと\n\n\n茶道があると丸一日なくなって悲しい\n\n"},{"slug":"2023-02-05","title":"時間過ぎるの早いね","content":"\n\n# やったこと\n\n- ゼミのスライド\n- 麦笑ラーメン\n\n## 麦笑ラーメン\n\n\n替え玉が有料になってから初の麦笑。変わらない美味しさで有料でも替え玉したくなる。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-06","title":"恥","content":"\n\n# やったこと\n\n- マセマ\n- STAPS\n\n## マセマ\n\n\nベクトルの復習をしつつ、行列の復習をしつつ。あまり進められなかったので、ペースアップしてやりたい。\n\n\n## STAPS\n\n\n本紹介プレゼン。グダリすぎて脇汗かいた。なんとなーくで構成を組むと上手く発表できないので、プレゼンする時は何を伝えるのかを明確にした上で、実際に発話して確認したい。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-07","title":"かちゃかちゃ","content":"\n\n# やったこと\n\n- プログラミングHaskell 6章残りと7章\n- アルジャーノンに花束を\n\n## プログラミングHaskell\n\n\n6章の演習問題でユークリッド互除法を再帰やって、やっぱりHaskellの簡潔さを感じた。7章の高階関数の話。naka-chanにfoldl,foldrの右結合や左結合はリストをどっちからなめるかで決まるということを教えてもらって納得できた。あとは無限リストの操作は右結合じゃないと処理が終わらないというのも確かにそうだと思った。7章の演習で2進数と10進数変換と文字列エンコードを高階関数でやろうというのがあって、関数合成と高階関数を用いて関数をかちゃかちゃと組み合わせていく感じが面白かった。コードもやっぱりおしゃれだ\n\n\n## アルジャーノンに花束を\n\n\n(ネタバレあり)\n\n\n読了。あしたのロボットの短編の一つにこの本の内容があり、ずっと読んでみたいと思っていた。チャーリーの知的障害から天才になったがゆえの苦悩が劇的に描かれていて心が苦しくなった。天才になったために見えてくる他人の敵意など、本当にこれでよかったのかと考えた。「利口」になったチャーリーと母親が会ったシーンは、おそらくチャーリーが求めていたものだった思う。母親と妹に会うことで分かる過去の記憶の真実に清々しくなった。結局チャリーの根っこの温かい心は、知能や感情が成長しても、退行しても変わらないことが分かって良かった。また訳者は相当能力がないと出来ないと思った。幼稚な文章から理路整然とした文章に表現を変えるのは、原文のニュアンスを正確に読み取り、日本語に対応させる必要があるからだ。\n\n\n# 思ったこと\n\n\n勉強やっていくぞー\n\n"},{"slug":"2023-02-08","title":"対策","content":"\n\n# やったこと\n\n- ゼミ発表\n- プログラミングHaskell 8章\n\n## ゼミ発表\n\n\n月曜日のプレゼンで大失敗をやらかしたので、しっかりと対策をとって発表できた。プレゼンは得意だと思いこんでいたけど、全くそうではないことが分かったので話すことを整理して練習するのは大事だと思った。\n\n\n## プログラミングHaskell 8章\n\n\n型と型クラスの章。再起型と構成子が面白い。木の表現が明快でわかりやすかった。演習で恒真式を評価するための型を定義するのが難しかったのでしっかり理解できるようにしたい。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-09","title":"今田美桜怖い","content":"\n\n# やったこと\n\n- ご飯\n- 限りなく透明に近いブルーを読む\n\n## ご飯\n\n\n久々にみんなで集まってご飯。やっぱり集まってああでもないこうでもないと盛り上がれるのは本当に楽しい。ずんちゃ！頑張れ！二軒目は久しぶりのブービーズ。歯科衛生士軍団にしばかれた :(\n\n\n## 限りなく透明に近いブルー\n\n\nなめだるまのバダサイが影響を受けたと言っていた小説なので気になって読んだ。これは確かになめだるまメンバーのバックグラウンドを知っていると、影響を受けたと言っていたことも頷ける。ほとんどが薬や乱交の描写ばかりで生々しい内容だった。作者の村上龍は多分経験者なんだろうなと思えるくらいに淡々とその光景が描かれている。最後は主人公はあの生活から抜け出せるのか。グロすぎるくらいの小説だった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-10","title":"さがす。","content":"\n\n# やったこと\n\n- 映画、さがすを見る\n\n## さがす\n\n\n去年やってた邦画。最後の最後まで気の抜けない映画だった。複数の人物の視点から物語を見ることで、解釈がどんどん広がっていく感じがして面白い。エンドロール直前の卓球シーンのゆっくりと対話する感じが、しみじみと感じていいシーンだった。\n\n\n# 思ったこと\n\n\n邦画もいいな\n\n"},{"slug":"2023-02-11","title":"STAPS　","content":"\n\n# やったこと\n\n- 第一回STAPS\n\n## 第一回STAPS\n\n\n分かっていたことだけど、テスト週間に毎週あるというのは結構きつい。PSFやKSFなど知らないことをたくさん知れた。結局のところ仮説立てて、検証をたくさんやっていかないと分からないことが多いのかなと感じた。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-12","title":"遠い昔、遥か彼方の銀河系で","content":"\n\n# やったこと\n\n- ファイアパンチを読む\n- コンアキ\n\n## ファイアパンチ\n\n\n何度読んだか分からないが、ファイアパンチはテスト週間になると読みたくなる。そして、やっぱり難しい内容だと思う。「演じる」ことが一つのテーマになっている。特にアグニはずっと他人からの見え方によって何かを演じてきた。これは仕方ないことだ。結局のところ、自分が何者かを決定するのは他人だからだ。しかし、ファイアパンチではなりたい自分になることで、救われる部分があったと感じる。トガタはひょうきんな女を演じていたが、かっこいいヒーローのように人を助けるようになったし、最期にはアグニにもそれを託した。\n\n\n# 思ったこと\n\n\n勉強をするんだ。\n\n"},{"slug":"2023-02-13","title":"従属、依存","content":"\n\n# やったこと\n\n- マセマ\n- コンアキ\n\n## マセマ\n\n\n線形空間の範囲を勉強。学校でやってないかなと思って本を読んでいた、やった気がする内容や用語が出てきた。しかし、あんまり覚えてなかったので定義をしっかり頭に入れて読んでいると、曖昧だった理解がかなり深まった。今日は線形独立や線形従属に関して、自由度を使った線形関係式や実際の図から理解できた。面白い。\n\n\n# 思ったこと\n\n\nマセマ面白い！\n\n"},{"slug":"2023-02-14","title":"俯瞰風景","content":"\n\n# やったこと\n\n- テスト\n\t- 経済\n\t- 英語\n- 空の境界 俯瞰風景読む\n\n## 経済\n\n\n真面目にスライドを読んでいると、意外に面白い。資本主義の歴史的な流れや用語を学ぶことで、世の中のニュースに対して色々考えることができるようになりそう。自分で勉強する分には面白いんだよなぁ。\n\n\n## 空の境界\n\n\nふと読み返したくなった。最近は月姫リメイクやまほよリメイクもやっていないので、型月（きのこ）作品には触れていない。久々に読んでも、独特なキャラクターの雰囲気がかっこいい。劇場版の音楽、Thanatosを流しながら、式が颯爽と走るのを想像するのが楽しい。「生きているのなら、神様だって殺してみせる。」式のかっこよさを堪能しながら先に進めていきたい。\n\n\n# 思ったこと\n\n\nテレビで何かのゲームでAngel Beats!コラボをやるっっていうので、久しぶりに気になった。正直こんな古いアニメとなんでコラボするんだって思ったが、やっぱり面白い作品だ。ところで同じkey作品の最近の作品で、神様になった日というのがある。今思い出すと、かなりアルジャーノンのアイディアを利用しているというのが分かる。より残酷なのだが。世の中、色々な作品のアイディアが結構受け継がれているように思う。いつまでもその意思が継承されるのはいいことだと思うし、より多くの作品に触れることでそれを感じたい。\n\n"},{"slug":"2023-02-15","title":"大変だー","content":"\n\n# やったこと\n\n- STAPS\n- テスト\n\n## STAPS\n\n\n大変だー！事業を考えることは難しい。PSFを考えた上で論理が破綻しないように市場定義したり、事業のセグメント考える。考慮しなくちゃいけないことは多いし、間違ってたらほぼ一から考え直し。PSFがそもそも間違ってないかと頭を使う。ここまで難しいと思うのは稀だ。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-16","title":"謎のイエローのガイ","content":"\n\n# やったこと\n\n- テスト\n- ジャンプラ読む\n\n## ジャンプラ\n\n\nバイオレンス・クリスマス。最近の読み切りでめちゃ良かった。主人公の女は12歳？の殺人鬼で楽しいから人を切り刻んで殺してしまう。普通は断罪されて然るべきだ。実際作中でも刑務所に入れられてしまう。けどプラナリアの遺伝子を持つサンタと出会ってから、それが許されてしまうのだ。切り刻まれたいサンタと人間を切り刻みたい少女でWin-Winだからいいじゃん！っていうカオスだけど、究極の多様性を感じた。ぶっ飛んでるけど、どこか救われるような面白い作品。\n\n\n# 思ったこと\n\n\nピーナッツくんがライブで歌うDrippin’ Lifeを聴くと涙出る。\n\n"},{"slug":"2023-02-17","title":"LEON","content":"\n\n# やったこと\n\n- LEON映画\n- テスト\n\n## LEON\n\n\nチェンソーマンレザ編でオマージュされていると聞いて、観た。チェンソーマンの元ネタを追ってきたが、あんまり良いことじゃないかもしれない。チェンソーマンの前提知識があるせいで感動が薄れてしまうのだ。特にレオンは、重要なラストシーンのオマージュだったので面白さが半減してしまった。こういうのは、たまたま気づいて心に留めておきたい。肝心の内容は好みが分かれそうな感じだった。簡単に言うと殺し屋おっさんと12歳女の純愛。多分リュック・ベンソンは筋金入りのロリコンなんだと思う。少しキツイシーンもあったが、あくまでもプラトニックで綺麗な関係性だったので、フィクションとして感情移入できて面白かった。ラストシーンは前提知識なしだったら、衝撃で記憶に残ってたと思う。Good映画 :-)\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-18","title":"あともう少し","content":"\n\n# やったこと\n\n- STAPS\n\n## STAPS\n\n\n第二回STAPSがあった。結局のところ事業の戦略や仮説を立てたところで、検証しないと前に進めない。考えれば考えるほど、無駄に時間をかけてしまい見える範囲が広くなって、向かうべき方向が分からなくなる。思考、検証の上手い塩梅のサイクルが大事だと思った。\n\n\n# 思ったこと\n\n\nテスト週間中にこのような重たいイベントがあるとキツい。しっかりテスト勉強やっていくぞ\n\n"},{"slug":"2023-02-19","title":"これは二徹確定かな","content":"\n\n# やったこと\n\n- テスト勉強\n\t- 制御工学\n\t- 情報数学\n\n## 制御工学\n\n\n中間でトンデモ点数を取ってしまったので、しっかり勉強しなければならない。ちゃんと理解しようとすると分からないことが多すぎる。割り切って効率よく、点数の取れる勉強をしよう。\n\n\n# 思ったこと\n\n\n二徹確定だ。死にそう\n\n"},{"slug":"2023-02-20","title":"高校生家族で候","content":"\n\n# やったこと\n\n- テスト勉強\n\t- 通信工学\n\t- 日本語表現\n\n## 通信工学\n\n\n昨日徹夜だったので昼寝をしてしまった。正直終わる気がしない。けど1から最後まで一気に進めると、意外に楽しい。通信の仕組みがなんとなく分かったり、自分たちが普段使っている通信の技術がたくさんの進歩の上に乗っかっているのを感じる。眠い。\n\n\n# 思ったこと\n\n\n高校生家族が唐突に最終回を迎えた。磯部磯兵衛物語が中学時代の青春の一つだった。毎週最後の方にある最高のギャグ漫画を楽しみにしていた。そして高校生家族も安定した楽しみを提供してくれていた。家族全員が高校生の笑いあり涙ありの物語が終わってしまうのは悲しい。仲間先生の新作を待つ\n\n"},{"slug":"2023-02-21","title":"テスト終わり！","content":"\n\n# やったこと\n\n- テスト\n\n# 思ったこと\n\n\nテストが全て終了！！！二徹なんて久方振りで大変だったが、なんとか乗り切った。清々しい。今日は早く寝よう。\n\n"},{"slug":"2023-02-22","title":"中間発表","content":"\n\n# やったこと\n\n- STAPS 中間発表\n\n## STAPS 中間発表\n\n\n他のチームが考えていたサービスの内容を聞いた。発表の上手いチームやマネタイズが面白いチームがあった。特に飛行機のリセール事業をやっていたチームが航空会社の課題と投資家を利用したマネタイズを行っていて面白かった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-23","title":"すべてを切れ","content":"\n\n# やったこと\n\n- 空の境界 痛覚残留読む\n- 映画大好きポンポさん見る\n- 茶道練習\n\n## 空の境界\n\n\nかっこいい。設定や世界観、描写全てがかっこいい。一歩間違えると厨二感満載なのに、それがいい具合である。また謎解き要素もあり、一つ一つの細かい描写や情報に意味があり、後でそういうこだったのか！と感嘆できる。「目的と手段の逆転」の話は刺さった…\n\n\n## ポンポさん\n\n\nレベチ映画ナードが映画を作る話。こういう創作物を作る系見ると、いろんな人間の思いが作品に詰まっているんだなと他の作品の見方も変わっていい。見るのは二回目だけど、理解がより深まって面白かった。初めてこの作品を見たときは、映画の主人公が映画の映画の主人公に自分を投影している構図をあまり意識していなかった分、今回はそこら辺を意識して見れて楽しめた。ある一つのことを突き通す、やり遂げるために全てを犠牲にするという考え方を体現している主人公はかっこいい。映画のために友情や家族、生活を切って映画と向き合ってきた。そうしてやっと報われるし、突き抜けた先に捨てたものを取り戻せるかもしれないという考えを見せてくれた。突き抜ける人を後押ししてくれるような作品だ。しかも90分でちょうどいいのでこれからも見ると思う。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-24","title":"街頭インタビュー","content":"\n\n# やったこと\n\n- タクさんとご飯\n- 街頭インタビュー\n\n## タクさん\n\n\nすきやきをご馳走していただいた。毎度ご飯は美味しい。今回はSTAPSのプログラムが半分ほど進んでいたので、そこの相談多めで話していた。事業を行う上で重要なのは、事業の業界についてとにかく解像度を上げること。オタクのように語れるようにしないといけないという話は腑に落ちた。STAPSで事業の市場機会や戦略を考える上で、業界について知識がないとやっぱり難しいし、立てる仮説もかなり解像度が低くなってしまう。企業に対しての仮説検証を進めないと、事業のアイディアを練り上げることが難しい段階に来ていたので、どのように企業にアプローチするかも相談した。そもそも企業は営利企業であるため、単純なヒアリングに応じてくれることはない。自分たちに利益があると判断した際に初めて話することができるのだ。よって自分たちが作っているものが刺さか、どうかはメールに営業資料を添付することでわかるという話は、かなり納得することができた。毎回ためになる話を聞けてありがたい。\n\n\n## 街頭インタビュー\n\n\nSTAPSでタクさんのアドバイスに合った通り、市場や事業に対する解像度を高めるために街頭インタビューでユーザ目線の意見を取り入れることにした。最初に声をかける際はかなり緊張したが、インタビューしてみるとわざわざ足を止めて、こちらの話に耳を傾けてくれる人が多く胸が熱くなった。これから街中でインタビューなどで話しかけられたら、少し足を止めて話を聞きたいと思った。インタビュー結果としては、アパレルECに関してほとんどが同じ課題感を共有していたので安心した。また各々で課題に対する解決策を持っていたりして面白いかった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-02-25","title":"茶会準備","content":"\n\n# やったこと\n\n- 茶会準備\n\n# 思ったこと\n\n\n明日が茶会本番だー。緊張もあるが、何度も稽古に付き合ってくださった先生に顔向けできるように頑張ろう。\n\n"},{"slug":"2023-02-26","title":"卒業生がいない茶会","content":"\n\n# やったこと\n\n- 茶会\n\n練習でできていたはずのお点前を失敗した。やっぱり本番は緊張する。遠くからはるばる二人の先輩に来ていただいた。当時卒業する際は、まだ三年生だった僕らを心配していたが、少しは成長した姿を見せれて安心してくれただろうか。お茶の基本を思い出すいい茶会だったように思う。\n\n\n# 思ったこと\n\n\n炭ってすごい。電気とはくらべものにならないくらいに火の勢いがある。\n\n\n二日連続で朝早くからの活動を乗り越えた！夜ご飯の中華料理屋は普段よりもおいしく感じた。\n\n"},{"slug":"2023-02-27","title":"4年定期テスト返し","content":"\n\n# やったこと\n\n- テスト返し\n\n# 思ったこと\n\n\nテストは思ったよりも良かったし、思ったよりも悪かった。特に文系教科が芳しくなかった。経済はちゃんと勉強すると意外と面白いので、来年度の並行開講科目はしっかりと受けようと思う。\n\n"},{"slug":"2023-02-28","title":"北海道上陸","content":"\n\n# やったこと\n\n- 北海道行く\n- ジンギスカン\n\n## 北海道\n\n\n数年ぶりにアメリカに行っていた友達と再会。見た目はちょっと変わっていたけど、中身は本当に変わってなくて懐かしい気持ちになった。みんなそれぞれの場所で生活しているので、同中のやつらで集まれる機会は中々貴重で大事したい。北海道はほとんどの道が雪が積もっているし、凍っているので大変だ。\n\n\n## ジンギスカン\n\n\n北海道といえばジンギスカンということでサッポロビール園に行ってきた。獣ぽくなく他の肉の違いが分からなかったが、美味しくいただけた。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-01","title":"回線がええんよ","content":"\n\n# やったこと\n\n- 二条市場\n- カニ鍋\n\n## 二条市場\n\n\nカニがたくさん売られていて、家に送るためのカニを買った。後日談だが届いたカニを確認すると、かなり小さいことが分かって少し失敗した気になった。それでも家族からは好評だったのでよし。またイクラ丼を食べた。贅沢にご飯の上にぎっしりといくらが乗ったどんぶりを平らげることが出来て、幸せだった。昔はいくらが大して高級じゃなかったというからびっくりだ。\n\n\n## カニ鍋\n\n\nカニ雑炊がうますぎる！こんなに安く美味しいカニが食べれるのは最高！\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-02","title":"WHY CRYING","content":"\n\n# やったこと\n\n- スノボ\n- すすきの\n\n## スノボ\n\n\n久々のスノボ。年々体幹が弱くなってきているので、スノボをやる前は滑れるか不安である。けど滑り始めると段々と感覚を取り戻して、S字を気持ちよく滑ることができる。スノボに行った中では一番歴が長いはずなのに、大してできないのは恥ずかしい。根に恐怖心があるため動きがぎこちないのだと思う。\n\n\n## すすきの\n\n\n街中は栄と歌舞伎町を組み合わせたような風で面白かった。しかし悲しい出来事があり、本当の幸せが何かわからなくなった。味噌ラーメンはとてつもなく美味しかった！\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-03","title":"Hybrid Rainbow","content":"\n\n# やったこと\n\n- 愛知戻る\n- MIB見る\n\n# 思ったこと\n\n\n中学卒業して何年も異なる環境で過ごし、色々と価値観が変わっているはずなのに、こうして集まると当時のように仲良く馬鹿やることができる。そんなことに感動してしまった。高専のやつらと離れ離れになってもまた馬鹿やれるだろうか。\n\n"},{"slug":"2023-03-04","title":"メル凸祭り","content":"\n\n# やったこと\n\n- STAPS\n\nECにサービスを導入してもらうプロダクトだったので、ECが持つ課題をヒアリングするためにお問い合わせメールを100社ほど送った。ヒアリングする際は、本音を引き出すためにこちらの情報はあまり開示せずにメールを送った。今思うとこの段階で色々と考えるべきだった。そもそも企業は、自分たちの利益にならないことをやるはずがないので、営業資料を完成させて送るくらいのことをやるべきだったんだと思う。最終ピッチまで時間がないのもあったのかも。返品ポリシーを確認して、どこにフォームやメールアドレスがあるかを確認するのは意外と骨が折れる。ポリシーで返品やってないのを見ると絶望。それなりの規模間の会社（上場している）じゃないと返品をそもそもやっていないことがざらだった。アメリカだとポリシーが緩くて、返品が当たり前だったりするらしい。ユーザインタビューで返品をしないのは、面倒だという理由以外にもポリシーがあげられそう。いや、そもそもポリシー探すのが面倒かも。ここら辺にうまくアプローチしているのがRecustomerな気がする。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-05","title":"180円のラーメン","content":"\n\n# やったこと\n\n- STAPS\n\n企業へのヒアリングがなくなったので、今後の進め方に関してかなり迷った。Station Aiのゆめみさんとの壁打ちで少し方向性が固まった。1.実現可能性に関して、技術の方面から固める。2.一つでも協力してくれる企業を探して、検証を進め信用を獲得していく。3.信用から契約を広げていく。ヒアリングができない分、競合の分析を進めた。既存のVirtusizeといったサービスは、自分を測る必要があり、これが結構面倒。またサイズは分かるかもしれないが、実際に着た時の雰囲気は分からない。ここら辺が今回考えたサービスの優位点。あとはプレゼン資料を結構進めた。\n\n\n家に帰った後に Recustomer のピッチを見た。正直プレゼン資料は今のままではダメだと思った。最初に課題のインパクトと課題によっておこる金銭的な損失を押し出すべきだと思い、最初の方は勝手に書き換えておいた。\n\n\n# 思ったこと\n\n\nスガキヤ180円は安すぎやろ\n\n"},{"slug":"2023-03-06","title":"将来は出社して働きたい（家から近いことが条件）","content":"\n\n# やったこと\n\n- STAPS\n\n昼から夜の9時近くまでWe WorkでSTAPS。最終ピッチの資料はかなり進んだ気がする。Officeソフトを使いすぎて、だいぶ慣れてきた。Recustomerのピッチを参考にさせてもらって、ストーリーをいい感じに修正できた。\n\n\nMVPやることになって鬱。でも仕方ない。いいピッチにするためには必要だ。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-07","title":"サウナトランス","content":"\n\n# やったこと\n\n- STAPS\n- サウナ\n\n## STAPS\n\n\nMVP検証をyuto-sanに手伝ってもらった。ありがたい。今回考えたソリューションがユーザにフィットしているかを調べるために検証を行った。今思えば、ちゃんと考えて検証を行うべきだった。なぜやるのかの解像度をもっと上げなければならなかった。ゆうとさんとは本当に久々に会ったが、気さくな先輩で楽しかった。\n\n\n## サウナ\n\n\nゆうとさんとのMVP検証が終わり、一人で竜泉寺に行った。サウナ日らしくて入浴無料券をもらえた。夜の1時半にもかかわらず、結構な人がいて驚いた。久々の銭湯&疲労で最高のサウナ体験ができると思い、時間もなかったので速攻で身体を温め、いざサウナへ。MY黄金タイムの8分が経ち、水風呂につかり、外気浴。外のベッドに寝転ぶと「整い」が。実は麻薬≒サウナではないだろうか。ベッドにどんどんと沈んでいく感覚。上では鳥が高速で八の字を描いている。そのうち眠気が襲ってきて、竜泉寺の店員さんに起こされて気づいた。また行きたい。\n\n\n# 思ったこと\n\n\n株式会社プログラマーさんすごい。街中でマッチングアプリの検証してる。素晴らしい行動力だ。\n\n\n昼間にNew Game!の一話を見ていた。主人公は小学生の頃から好きだったゲームの会社に入社して、最初のプロジェクトで自分が好きだったゲームの続編に携わることになる。なんとなく自分に重ねてしまった。当時小5、6くらいのときにスマホゲームが出て、インターンとしてそのゲームアプリの開発に携わる。意外と稀なことだ。7,8年もゲームが続き、一方でエンジニアとして俺がやってきた結果がこれなので感慨深い。\n\n"},{"slug":"2023-03-08","title":"Blender入門","content":"\n\n# やったこと\n\n- STAPS\n- 遠い空の向こうにを見る\n\n## STAPS\n\n\nまさかSTAPSをやっていく中で、Blenderを触ることになるとは思ってもいなかった。Blenderのような複雑なソフトウェアは苦手だ。慣れるまで時間がかかる。幸いなことに今回はモデリング作業がなく、スマホでスキャンしたモデルを動かして、カメラを制御するだけだったのでなんとかなった。他にもCanvaを使う作業もずっとやっていて、だんだんと手に馴染んできた。\n\n\n## 遠い空の向こうに\n\n\n「ロケットボーイズ」という本をずっと読みたいと思っていて、どうやらこの映画が本を映像化したものらしく見てみた。元NASAエンジニアの実話に基づくお話。主人公たち少年は、炭鉱の町に生まれて、みんな炭鉱に就職するものだと思っていた。あるときソ連のスプートニク1号を見た主人公は、宇宙に強い憧れを持つ。そして次第に自分もロケットを作りたいと思うようになり、炭鉱現場の長である父と衝突しながらも、ロケットを作っていく。本当に胸が熱くなる物語だった。ロケットが飛ばなくても何度も何度もトライ＆エラーを繰り返して、苦手だった物理も克服していき、町の人や炭鉱の人も巻き込んでいく。そんな強いエネルギーを持った少年たちに胸が熱くなった。主人公と父は考え方が違っているが、最後にはお互いに歩み寄ってくシーンは最高だった。物語全体に流れる温かい空気が本当に素晴らしい。新しいことに挑戦しようとする少年たちを応援する町の人たちには感動した。その応援を受けて、ロケットを打ち上げ、奨学金を勝ち取る少年たちを見て、自分も受験頑張ろうと思えた。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-09","title":"ずっとSTAPSだな","content":"\n\n# やったこと\n\n- STAPS\n\nスライドをとにかく埋めていっていたが、裏側にロジックがないせいで中身のないものになっていた。なぜ企業からこのくらいのお金が取れるのか、企業に対してどれほどの価値を提供できるのか。究極のところ企業からお金をとれるのは、その企業の利益を上げるかコストを下げることが出来た場合である。さらにROIという基準が乗っかり、費用に対してどのくらいの利益を提供できるかが重要になる。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-10","title":"スライド修正","content":"\n\n# やったこと\n\n- STAPS\n\nスライドを修正。企業へのヒアリングがないせいで、売り上げ向上が見込めますっていう薄いことしか言えない。ROIも「売り上げがこれくらい上がる」予想（ユーザヒアリングを元にはしている）で立てられているロジックなので、事実の上に成り立っていない薄いものになってしまっている。動画を修正。変な格好でずっと動画を撮っているので、家族から不審がられる。Figmaの力がついていく～\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-11","title":"一生動画編集してるやん","content":"\n\n# やったこと\n\n- STAPS\n\n動画修正。スクリプトと違うという指摘を受けて修正。このことを受けて、なんとなく指摘されるのを予測して作業を進めることが出来ている。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-12","title":"最終ピッチ","content":"\n\n# やったこと\n\n- STAPS 最終ピッチ\n- 打ち上げ\n\n## STAPS 最終ピッチ\n\n\nやれることは全てやった発表だった。ここ一週間はずっとSTAPSのことをやっていたし、マスターさんも言葉に詰まりながらもいい発表をしてくれた。同時に自分たちの実力不足も感じた。自分たちのピッチが思い通りに伝わっていないことも分かった。当然のように企業との検証をガンガン進めていたチームがたくさんあった。特にJUNJUNというお金のない中小企業のインターンと学生をマッチングするサービスを考案していたチームがすごかった。課題の解像度が企業と学校のヒアリングによって高いのはもちろん、ソリューションもきちんと企業と検証を進める中で練り上げられていた。彼らによるとやはり企業ヒアリングは、自分たちのソリューションがフィットしそうな規模間の会社を見極め、しっかりと営業資料を作りこんだそう。事業への解像度も高く、素晴らしかった。\n\n\n## 打ち上げ\n\n\nある一つのチームのやつらが俺たち高専生の鏡写しかというぐらい似たノリをしていた。意識の高い人たちはどんなだろうと身構えていたが、打ち上げではみんな普通だった。最後はカラオケでオールしたが、すごく盛り上がって楽しかった。\n\n\n# 思ったこと\n\n\nSTAPSはいい経験になった。事業を作ることへの解像度がとても高くなった。果てしなく難しいことだし、考えることが多い。生半可な覚悟や力で起業はできないということが身をもって認識できた。それ以外にも街頭インタビューや企業へのメル凸など経験して、意外とできないことはないじゃないかくらいの心持になった。機会があればまた挑戦したい。\n\n"},{"slug":"2023-03-13","title":"虚無","content":"\n\n# やったこと\n\n- ダンボール戦機\n\nダンボール戦機が今見ても面白い。3Dモデルのアニメーションはかっこよく、ほどよいシナリオの進みで良い。小1に見ていたとは思えないほど、内容を覚えていて驚いた。OPは聞いたときは懐かしすぎて、涙を流してしまった。\n\n\n# 思ったこと\n\n\n燃え尽きです\n\n"},{"slug":"2023-03-14","title":"海道ジン","content":"\n\n# やったこと\n\n- きまぐれロボット\n\n星新一の短編集。あんまりショートストーリーは好きじゃないかもしれない。小学生の頃の読書の時間にぴったりなボリューム感だ。毎回意外なラストで予想が外れたりするので、それは面白かった。\n\n\n# 思ったこと\n\n\n明日から流石に勉強しやす。\n\n"},{"slug":"2023-03-15","title":"マジで感謝","content":"\n\n# やったこと\n\n- マセマ\n\n## マセマ　線形空間\n\n\n受験勉強でもちゃんとやると楽しいのだが、定義や証明をやっていると結構時間がかかる。\n\n\n# 思ったこと\n\n\n受験勉強辛い。そんなときの支えがイナイレの曲だ。「マジで感謝」の歌詞は勇気が出る。成長した今聴くと、クサイとも思うがシンプルでいい。頑張っていくぞ。\n\n"},{"slug":"2023-03-16","title":"馬場社長！","content":"\n\n# やったこと\n\n- マセマ\n\n## マセマ　線形写像\n\n\nマセマの本が結構面白い。写像の種類がKer と Im によって拡張されていくのを説明するセクションが楽しすぎた。張られた伏線を綺麗に回収していく流れが完璧だった。馬場社長は天才だ。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-17","title":"馬場社長！勘弁してください","content":"\n\n# やったこと\n\n- マセマ　行列の対角化\n\n計量線形空間は行列だけのものだけではなく、定積分が線形空間を張ることができるらしい。ちゃんと理解したい。このことがフーリエ級数解析につながるらしい。馬場先生、そこも書いてほしかった。あとは対角化が線形微分方程式にもつながるとか。気になる。\n\n\n# 思ったこと\n\n\nせっかくちゃんと線形代数をやり始めたので、その応用を息抜きにやろうと思い、「プログラミングのための線形代数」を買った。はやく読んでみたい。\n\n"},{"slug":"2023-03-18","title":"これからもよろしく。馬場社長","content":"\n\n# やったこと\n\n- マセマ　ジョルダン標準形\n\nついにマセマ線形代数完結。最後の方は証明の論理が結構馴染んできてわかりやすかった。ただ2次形式を標準形に変換するときの変数変換の流れがよくわからなかった。こっからは演習で地固めをやっていく。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-19","title":"久々にコード書いた","content":"\n\n# やったこと\n\n- Nippoの新機能開発\n\nishibe-chan が日報の情報管理について話していて、ちょっとした検索機能があるといいなーと思ったので、キーワード検索機能を追加することにした。正直言って真の目的は久々にコードを書くことだった。今日はUIだけ書いていたけど、結構楽しかった。Chakraは時間がないときとかはレールに乗っかって楽だけど、ちょっとCSSで変わったことをしようとすると結構面倒だし、せっかくTrasitionでいい感じのやつがあってもカスタマイズ性が悪くて、ちょっとした妥協をしなくちゃいけない。TailwindCSS+Headless UIが普段の開発ではマッチする気がする。\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-20","title":"GoodBye Senpai","content":"\n\n# やったこと\n\n- 徹底研究 11章\n\n# 思ったこと\n\n\nお世話になった先輩たちが卒業していった。俺たちもあと一年か…\n\n"},{"slug":"2023-03-21","title":"受験","content":"\n\n# やったこと\n\n- 徹底研究 12章\n\nマセマのおかげか徹底研究の演習が捗る。わかって解けてる感が気持ちいい。微積もマセマからやったほうがいいか？\n\n\n# 思ったこと\n\n"},{"slug":"2023-03-22","title":"感謝感激雨あられ","content":"\n\n# やったこと\n\n- 徹底研究 13章\n\n# 思ったこと\n\n\n受験は情報が命だなぁ\n\n"},{"slug":"2023-03-23","title":"Glispおしゃれっつだ","content":"\n\n# やったこと\n\n- 徹底研究13章　章末問題\n- かつみや\n\n# 思ったこと\n\n\n[Baku 麦](https://baku89.com/) さんすごい。Twitterでフォローだけしていて、改めてWorksを見たらとてつもない。Music VideoやサイトのデザインをCGなどの技術を使って、かっこよく表現している。そして開発の過程で必要になったツールは自分で作っている。ハッカーとアーティストのキメラだ。最近は受験勉強で線形代数ばかり解いていて、線形代数が役に立ちそうなこういったCG技術に興味が湧いている。\n\n"},{"slug":"2023-03-24","title":"3Dやりたい","content":"\n\n# やったこと\n\n- 徹底研究12章 章末問題\n- Blogにキーワード検索機能追加\n\nキーワード検索機能開発を勉強の息抜きにやっていて完成した。NotionからMarkdownファイルを生成してPRを出すワークフローのあとに、キーワードファイルを作成するワークフローを追加することでいい感じに拡張できた。息抜きがなくなって悲しい。\n\n\n# 思ったこと\n\n\n結構前からThree.jsでポートフォリオを作りたいと思っていて、少しずつ構想を考えている。今日Three.jsのサンプルを見ていたら、たくさん面白いのがあった。いわゆるゲームのようなサイトやスクロールすることでアニメーションが流れるサイトなど、かなり表現力が高いことがわかる。まだ本格的には作れないが、色々と構想を練ろうと思う。\n\n"},{"slug":"2023-03-25","title":"空間が掴めてきた","content":"\n\n# やったこと\n\n- 徹底研究11章　章末問題\n\nマセマだと理解が浅かった線型写像の表現行列がここにきて、かなり問題になった。YouTubeでどこかの大学の講義が上がっていて、表現行列の導出までやってくれていて、結構理解が進んだ。マセマはたまに荒削りな感じがする。\n\n\n# 思ったこと\n\n\nプログラミングのための線形代数の一節で、数学は「どういう性質か」だけを共通認識として持って議論をする。それによって「〇〇は何であるか」という哲学的な議論をする必要がなくなるというのがあって、すごく腑に落ちた。性質だけさえ満たしていれば、誰がどんなふうに解釈してもいいのだ。\n\n"},{"slug":"2023-03-26","title":"LEX","content":"\n\n# やったこと\n\n- 静岡ドライブ\n- さわやか\n\n# 思ったこと\n\n\nダンボール戦機が終わってしまった。最初は懐かしさだけで見ていたが、回を重ねるごとに小学生の時には、気づかなかった面白さを感じていた。ただのLBXどうしのかっこいい戦いだと思っていたのが、意外なストーリー展開とガンダムのような正義vs正義の構図が今でも楽しめる。むしろ小学生では楽しめない要素だ。特にラストシーンはLBXの戦闘シーンではないものの、代表的な名場面だと思う。\n\n"},{"slug":"2023-03-27","title":"ヨコオタロウ…","content":"\n\n# やったこと\n\n- 徹底研究　章末問題\n\n# 思ったこと\n\n\nNierのアニメは原作ゲーム勢に向けたものだと思う。原作内のメインストーリーとはズレたネタをフューチャーしてみたり、微妙にシナリオを変えてみたりとゲームをやっている身からすると面白い。BGMも物語の背景を知っていると、より感情移入しやすいようになっている。一方で原作ゲームを知らない人間からすると、世界観が掴みにくく、あんまり面白くないかも？\n\n"},{"slug":"2023-03-28","title":"タイトル分からん","content":"\n\n# やったこと\n\n- 徹底研究　章末問題\n\n勉強の進捗スピードが落ちている。早寝早起きを心がけてやっていこう。\n\n\n# 思ったこと\n\n\nNotionを使って日報を書いているので、その日の日報生成をスケジューラで自動化したい。\n\n\n日報のジャンル分けを自動で分類してくれる仕組み作れないかな。\n\n"},{"slug":"2023-03-29","title":"インターネットの海、あるいは海","content":"\n\n# やったこと\n\n- 徹底研究　章末問題\n\n線形代数はかなり慣れてきた。明日からは解析の復習やっていくぞ。\n\n\n# 思ったこと\n\n\n編入したい大学は研究したいことベースで考えていたが、特に実績？などは見ずに決めていた。低レイヤ周りのことがやりたかったので、一応OS学会などを確認してみた。すると、なんと志望している研究室の名前が漏れなく、全てあったので嬉しかった。去年のインターンで出会った方の名前もあって、世の中意外と狭いなと思った。\n\n"},{"slug":"2023-03-30","title":"集中","content":"\n\n# やったこと\n\n\n# 思ったこと\n\n\n何かしようと思っても、将来への不安からずっとネットサーフィンをしてしまった。ダメだ。\n\n"},{"slug":"2023-03-31","title":"Scrapbox開設","content":"\n\n# やったこと\n\n- Scrapbox\n\n[ishibe-chan](https://scrapbox.io/is-hoku/) や [naka-chan](https://scrapbox.io/lemonadern/) のマネ。当面は勉強のメモを残そうと思う。俺の性格的上メモを書くことが気持ちよくなって、それが目的になっちゃあ可能性もあるので、いい感じにコントロールしたい。\n\n\n# 思ったこと\n\n\n何をやったか思い出せない。何もやってないんだろう。\n\n"},{"slug":"2023-04-01","title":"タイヤ交換など","content":"\n\n# やったこと\n\n- タイヤ交換\n- ハッシュ表の[復習](https://scrapbox.io/Dz99/%E5%AE%9A%E6%9C%ACC%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9E%E3%81%AE%E3%81%9F%E3%82%81%E3%81%AE%E3%82%A2%E3%83%AB%E3%82%B4%E3%83%AA%E3%82%BA%E3%83%A0%E3%81%A8%E3%83%87%E3%83%BC%E3%82%BF%E6%A7%8B%E9%80%A0)\n- 徹底研究 1章\n\n# 思ったこと\n\n\n意外とアルデの知識が抜け落ちてて悲しい。新しいアルも勉強しないと。\n\n"},{"slug":"2023-04-02","title":"たまには飯","content":"\n\n# やったこと\n\n- 徹底研究 2,3章\n- 飯\n\n1週目から結構時間が空いたが、前よりも明らかに解いてやってる感がする。前回よりも焦っていないからか、ずっと数学やっていて慣れたのか。\n\n\n# 思ったこと\n\n\n毎日椅子に座っているだけなので、ご飯に行ってみんなと話すだけでめちゃ楽しい。定期的なご飯、大事。\n\n\n数学で〇〇がやりたいから〇〇しようという感覚が掴めそうな気がする。勉強し初めの頃は、解説を読むのさえも苦痛だったけど、最近は楽しくなってきた。\n\n"},{"slug":"2023-04-03","title":"進捗…","content":"\n\n# やったこと\n\n\n# 思ったこと\n\n\n1日が短い。時間が足りない。なぜ計画通りに物事が進まないのか。\n\n"},{"slug":"2023-04-04","title":"リリカルLisp","content":"\n\n# やったこと\n\n- 徹底研究　4章章末\n- リリカルLispちょっと\n\nリリカルLisp面白いぞ。Lispの基本のきを感じれるといった触れ込みだったが、結構詳しく思えた。ただの文法だけじゃなく、おそらくインタプリタの実装レベルの話までしているところもある。特に束縛変数、自由変数のための環境の話が面白かった。あとは car,cdr の読み方が説明されていて、cdrをクダーと読むらしく、ずっとシーディーアルと読んでいたので、新鮮だった。冷静に考えたらそのままシーディーアールなんて読まないか。SICPの最初の方に似たような話があった気がする。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-05","title":"登校初日","content":"\n\n# やったこと\n\n- 徹底研究 11~13章\n\n# 思ったこと\n\n\nほとんど一人でいると自分では気づかないが、結構疲れていることが多い。久々に学校に行ってみんなと話すと、いつもよりおしゃべりになってびっくりする。\n\n"},{"slug":"2023-04-06","title":"研究テーマを探そう","content":"\n\n# やったこと\n\n- 研究室\n\n# 思ったこと\n\n\n研究室に行く前に研究に対する心構えなどを聞いていた。話を聞いていると、STAPSで教わったようなことも多く、お金儲けも研究でも根の部分は同じだと感じた。課題やテーマが重要であることは多分どの世界でも共通なんだなぁ。\n\n"},{"slug":"2023-04-07","title":"金曜日、授業たくさん。楽しいかも","content":"\n\n# やったこと\n\n- 徹底研究 5章\n\n# 思ったこと\n\n\nグラフ理論ありがとうございます。受験に役立ちそうだし、面白そうです。数値解析やシステム工学も面白いアルゴリや話が聞けそうです。\n\n"},{"slug":"2023-04-08","title":"Vターン","content":"\n\n# やったこと\n\n- サクラクエスト\n\n久々にグサグサと刺さったアニメだった。[感想など](https://scrapbox.io/Dz99/%E3%82%B5%E3%82%AF%E3%83%A9%E3%82%AF%E3%82%A8%E3%82%B9%E3%83%88)\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-09","title":"おっすおっす","content":"\n\n# やったこと\n\n- STAPS集まり\n\n# 思ったこと\n\n\nやっぱりあのとき感じた共鳴はホンモノだったか。だけど、遊びすぎると頭がおかしくなる。\n\n"},{"slug":"2023-04-10","title":"歴史の上で","content":"\n\n# やったこと\n\n- 論文読み\n\nここ最近の平野研の研究、大きな目的のために脈々と小さな課題解決が積み上げられている感じ、いいな。\n\n\n# 思ったこと\n\n\nすみません。私の進捗状況が悪いです。心機一転、頑張っていきますのでよろしくお願いいたします。\n\n"},{"slug":"2023-04-11","title":"岐阜たん","content":"\n\n# やったこと\n\n- ラーメン\n- バックトラック法\n\n# 思ったこと\n\n\nVHDLを書いてチカチカ楽しい\n\n"},{"slug":"2023-04-12","title":"研究と実用化","content":"\n\n# やったこと\n\n- 研究室\n\nこれからハイパーバイザをいじっていくんだと思うとわくわくしてくる。ハイパーバイザとOSは似ているという話も腑に落ちた。\n\n\nBitvisorは研究によって開発されたもので、対応しているハードウェアが限られいて、実用的であるとはいいにくい。私はそこが気になっていて、もしBitvisorを用いた研究で課題を解決したとして、それは局所的な解決策であり、多くの人たちにはアプローチできないのではと思っていた。先生にそれっぽいことを言うと、研究と実用化の話をされた。端的に言うと、実用化は企業の役割である。研究は特定の課題に対して、世の中にあまりないアプローチの方法を提示する。それを足がかりに企業が実用化について考えたり、他の誰かが実用化に関する研究をするのだと。確かにと感じた。\n\n\n# 思ったこと\n\n\n平野先生がBitvisorのこと話しくれるの楽しい。\n\n"},{"slug":"2023-04-13","title":"Bitvisorってやつを理解したい","content":"\n\n# やったこと\n\n- 研究室\n- DP\n\n動的計画法面白い。ボトムアップで問題を解いていく感じが新鮮。\n\n\n# 思ったこと\n\n\nxbacklight導入。急にバックライト気になったけど、よくあの光度で耐えてたな、俺。\n\n"},{"slug":"2023-04-14","title":"CDKいいね","content":"\n\n# やったこと\n\n- 日報カイゼン\n\n手動でNotionにページを追加するのが辛い。このせいで日報を書かないまである。したがって毎日cronでその日の日報を生成してくれるようにした。Cloudformationで構築したが、chahaanに教えてもらったCDKがめちゃ便利だ。ぽちぽち押さずに使いたいリソースとオプションをちょっと書くだけで、デプロイも簡単。\n\n\n# 思ったこと\n\n\nNotionのバグが辛かった。GPTちゃん、ちょっとコード書いてくれてありがとう。\n\n"},{"slug":"2023-04-15","title":"malloc/free","content":"\n\n# やったこと\n\n- 徹底研究 5章章末問題, 6章\n- メモリ管理アルゴリズム\n\n受験勉強の役立たなそうなアルゴリズムばかりやってしまっている。今日はメモリ管理アルゴリズム。コードを書いたのはmalloc/freeの簡易版。昔、双方向リンクリスト書いて何に使うんだろうと思っていたが、ヒープ領域の表現にはぴったりだった。ガベレージコレクションの文脈でLispが出ていて😊となった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-16","title":"キャッシュ","content":"\n\n# やったこと\n\n- アルゴリ勉強。キャッシュ\n- 徹底研究6章\n\nディスクのバッファリングやキャッシュ破棄に関するアルゴリズムを知れた。まぁそうだよなって内容でありつつ、naka-chan が前話してたデータベースの話に通じるものがありそうだった。流石に受験では役に立ちそうにない。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-17","title":"何もせず","content":"\n\n# やったこと\n\n- 徹底研究 6章 章末\n\n# 思ったこと\n\n\n勉強の進捗状況が悪い。自分の理想と現実の乖離がでかすぎて頭がおかしくなりそう。別に無理なタスクを振っているわけではなく、ただただ自分の怠惰が原因だから許せない。\n\n"},{"slug":"2023-04-18","title":"ls","content":"\n\n# やったこと\n\n- 徹底研究 7章\n\n# 思ったこと\n\n\nFPGAボードを使うと、VHDLが楽しくなる。ボードのチカチカにやられてしまった。\n\n"},{"slug":"2023-04-19","title":"テーマ難しい","content":"\n\n# やったこと\n\n- 徹底研究 7章\n- 研究室\n\nなぜNICのデバドラを作るのか。差分メモリダンプ機構のボトルネックについて平野先生に教えてもらった。面白かった。\n\n\n# 思ったこと\n\n\n研究テーマ難しいね。先行研究を元に開発っぽいことをやろうとすると、開発する理由が希薄になりやすい。\n\n"},{"slug":"2023-04-20","title":"研究室行くの楽しい","content":"\n\n# やったこと\n\n- 研究室\n- 徹底研究 7章 章末問題\n\nBitVisorをビルドして動かすなどをしていた。毎日BitVisorの情報を摂取できて楽しい。grubのこととかやってたけど、普通にLinuxデスクトップ触ってなかったら、それなりに手こずってそうだと思ったので、5年前の兼松さんに感謝。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-21","title":"最高の1日","content":"\n\n# やったこと\n\n- 徹底研究 8章\n- ご飯\n\nみんなとご飯は楽しいね。マンズの体験や話が面白くて、俺もより面白く生きようと思った。\n\n\n# 思ったこと\n\n\nシステム工学の階層化意思決定でExcelを使って、初めてちゃんとしたExcelの使い方をして好きになった。\n\n"},{"slug":"2023-04-22","title":"文章ゴミやね","content":"\n\n# やったこと\n\n- 徹底研究8章　章末問題\n\n# 思ったこと\n\n\n少し前の日報やScrapboxの文章を読み返すと、いかに自分が読みにくいうんちみたいな文を生成しているかが分かる。マジで恥ずかしすぎて、読んでる途中にブラウザバックするレベル。早急にtextlintを導入せねば。\n\n"},{"slug":"2023-04-23","title":"過去問","content":"\n\n# やったこと\n\n- 過去問\n- ヒープソート\n\n過去問今日やっといて良かった。普通に高校範囲みたいなの出てて、なんも見てなかったら一発で詰んでた。重積分とか偏微分出してくれ。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-24","title":"Archは壊れてなんぼ","content":"\n\n# やったこと\n\n- 過去問\n- AUR周りのバグ調査\n\n# 思ったこと\n\n\nガンダム水星の魔女がアツい。SF考えてる人ってほんとに天才だとおもう。面白くて、ワクワクするような世界観や設定を最初に創造して、そこにストーリーテリングを乗っけてるんだろうな。\n\n"},{"slug":"2023-04-25","title":"GPT!GPT!GPT!","content":"\n\n# やったこと\n\n- 過去問\n- ふうみや\n\nC言語を書いていたら、よくわからないセグフォが起こっていて、ChatGPTに聞いたら一瞬で解決した。まじで検索する手間が全く無いので最強。早く課金したい。\n\n\nふうみやは安くてうまい！以上。\n\n\n# 思ったこと\n\n\nアマゾンで買った超安い茶軸キーボードが届いた。キーを打つたびに、金属の反響音みたいなが鳴って辛い。完全に安かろう悪かろうだった。YouTubeを見てたら、100均で対策ができそうだったのでもう少し頑張ってみようと思う。\n\n"},{"slug":"2023-04-26","title":"睡眠","content":"\n\n# やったこと\n\n- 研究室\n\nnaka-chan’s PC組み立てをやった。先輩の知識がすごかった。BitVisorで10G NICが動かなくて困ったが、esaに似た状況の対策がまとめられていて、かなり助かった。ドキュメント大事。\n\n\n# 思ったこと\n\n\nたくさん寝てしまった。\n\n"},{"slug":"2023-04-27","title":"Windows on NVMe","content":"\n\n# やったこと\n\n- 研究室\n- 一次変数の微分の演習\n\nゲストOSをNVMeに移行した上で、BitVisorを動かそうしている。来週に持ち越し。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-28","title":"のどいた","content":"\n\n# やったこと\n\n- 徹底研究 一次変数積分\n\n# 思ったこと\n\n\n喉痛い&鼻詰まりが酷すぎて、何も集中できなかった。早よ寝る。\n\n"},{"slug":"2023-04-29","title":"死","content":"\n\n# やったこと\n\n\n完全に風を引いてダウンしてた。適度な休憩も大事。\n\n\n# 思ったこと\n\n"},{"slug":"2023-04-30","title":"休憩","content":"\n\n# やったこと\n\n\n一生映画見つつ、編入用の志望理由書などを書いていた。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-01","title":"志望動機むずいね","content":"\n\n# やったこと\n\n- 徹底研究3章\n- 課題\n\n# 思ったこと\n\n\nApple Musicで思わぬ出会いがあると嬉しい。昔父親の車の中で聞いていた曲。自分が成長してから聞くようになった曲。意外な関連性があったりして面白い。\n\n"},{"slug":"2023-05-02","title":"かじけん","content":"\n\n# やったこと\n\n- みんなでかじけん\n- 過去問特訓\n\n# 思ったこと\n\n\n制約ありのMIPSアセンブリをバイナリに変換するプログラム書きたい\n\n"},{"slug":"2023-05-03","title":"星の王子さま","content":"\n\n# やったこと\n\n- 星の王子さま読む\n- 過去問特訓\n\n(多分)有名な本、星の王子さまを読んだ。物語自体は平易だった。退屈といえば退屈。けど、伝えたいことみたいなのはストレートで良かった。自分にとって特別なもの、自分が誰かにとって特別かは、ものや人の価値によって決まるんじゃなく、「飼い慣らして(されて)いる」かで決まる。ずっとシンプルだよね。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-04","title":"いとこ","content":"\n\n# やったこと\n\n- いとこと会った\n- 映画マリオブラザーズみた\n\nマリオの映画は面白かった。スーパーマリオブラザーズやマリオカートの小ネタがたくさんあって、子供の頃の楽しい思い出が蘇ってきた。3DCGやカメラのクオリティが高くて迫力があった。\n\n\n# 思ったこと\n\n\nいとこが今小学四年生なんだけど、めちゃくちゃパワフル。キャッチボールやってて、俺なんかはすぐ疲れるんだけど、いとこは疲れの色を一切見せない。公園から帰るときも、まだまだやり足りない感じだった。数年前はあんなに可愛かったのに… もしかしたら大物になるかも\n\n"},{"slug":"2023-05-05","title":"何もない","content":"\n\n# やったこと\n\n- 課題\n- 線形代数\n\n# 思ったこと\n\n\nNew Game!、なんだかんだで4回くらい見返してる気がするな。1番見てる作品かも。\n\n"},{"slug":"2023-05-06","title":"ヤクルト1000 or 運動","content":"\n\n# やったこと\n\n- 線形代数\n- 髪切り\n\n# 思ったこと\n\n\nいとことキャッチボールして寝た日。ここ最近で1番の快眠だった。最近は夢を見るような浅い睡眠ばかりで、疲れがあんまり取れていないような気がしていたが、その日はめちゃくちゃ良く寝れた。最初は運動したおかげだと思っていたが、ヤクルト1000のおかげだったかもしれない。どっちが良かったんだろう…\n\n"},{"slug":"2023-05-07","title":"まじでGUIソフトのコンパイルで人生終わるぞ","content":"\n\n# やったこと\n\n- 過去問\n- Gentoo\n\n# 思ったこと\n\n\n高一のときにやったなぁっていう問題が一番泣けてくる。徹底研究には出てこないし、中々思い出せないし。つらたん\n\n\n明日は志望動機を書かないとなぁ…\n\n"},{"slug":"2023-05-08","title":"校正","content":"\n\n# やったこと\n\n- Gentoo整え\n- 志望動機考える\n\n# 思ったこと\n\n\n志望動機の校正をChatGPTにやってもらった。一瞬でいいものに修正してくれてありがたい。シスプロの内容が編入勉強でやったアルゴリズムにもあって面白かった。\n\n"},{"slug":"2023-05-09","title":"ガンダムとこのすば","content":"\n\n# やったこと\n\n- 願書\n- 過去問\n\n# 思ったこと\n\n\nガンダムとこのすばがアツい\n\n"},{"slug":"2023-05-10","title":"Windowsくんさぁ…","content":"\n\n# やったこと\n\n- 卒研\n- 過去問\n\n# 思ったこと\n\n\n卒研の進捗は出ないし、過去問のグラフ問題に殺されるしダメダメだ。\n\n"},{"slug":"2023-05-11","title":"分散コンパイル気持ちよすぎだろ","content":"\n"},{"slug":"2023-05-12","title":"クロスコンパイルしたくて","content":"\n\n# やったこと\n\n- 過去問\n- Gentooクロスコンパイル環境整え\n\n# 思ったこと\n\n\n普通に遊びすぎよ。もっと真面目に勉強しなさい。\n\n"},{"slug":"2023-05-13","title":"懐かしいな、この感じ","content":"\n\n# やったこと\n\n- 寮祭\n- 過去問\n\nマンズのダンスを見に行った。内容はNEO GENDER LESSって感じで、メッセージ性がかなり強くて🫣面白かった🙄久々に寮の雰囲気を味わえて楽しかった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-14","title":"石川くん！！","content":"\n\n# やったこと\n\n- 過去問\n- 石川くん、行け！！を見た\n\n[感想](https://scrapbox.io/Dz99/%E7%9F%B3%E5%B7%9D%E5%90%9B%E3%80%81%E8%A1%8C%E3%81%91%EF%BC%81%EF%BC%81)\n\n\n# 思ったこと\n\n\nマリオの映画が始まる前にやってたCMは劇場限定らしい。なんとなーくいいCMだなーと思ってたけど、かなり映画そのもの、ゲームのそのものに関連する内容だったわ。\n\n"},{"slug":"2023-05-15","title":"残り1ヶ月か","content":"\n\n# やったこと\n\n- 過去問\n- 課題\n\n# 思ったこと\n\n\nシスプロの時間に面白い記事見つけた。[Linuxに勝てなかったPlan9](https://atmarkit.itmedia.co.jp/news/analysis/200902/09/future.html)と[アンサー](https://oraccha.hatenadiary.org/entry/20090211/1234288481)。研究と実用の話やコンピュータの進化はもはや高レイヤでやるべきだって話は確かにって思う。でもロマンはコンピュータそのものにあるよ。\n\n"},{"slug":"2023-05-16","title":"いい日","content":"\n\n# やったこと\n\n- 過去問\n\n筑波の専門の問題面白い。ただ前提知識をあんまり必要としない問題が多いから、編入勉強にならないかも。\n\n\n# 思ったこと\n\n\nみんなと夏休みに行きたい場所について話した。未来を楽しみに、あと約一ヶ月気張っていこう。\n\n"},{"slug":"2023-05-17","title":"てぇーへんだ","content":"\n\n# やったこと\n\n- 願書\n- 卒研\n- アルゴリ\n\n# 思ったこと\n\n\n志望動機の手書きは大変だよ。\n\n"},{"slug":"2023-05-18","title":"卒研環境","content":"\n\n# やったこと\n\n- 卒研\n- アルゴリ\n\nBitVisor環境でつまってた部分が一気に進んだ。来週からついに始まっていくぞ。\n\n\n# 思ったこと\n\n\n最近数学やれてないな。今日やろうと思ったけど寝てしまった。\n\n"},{"slug":"2023-05-19","title":"ナイス解法","content":"\n\n# やったこと\n\n- 過去問\n\n分からなかった問題が解けて良かった。受験仲間って言葉は存在するのかもしれない\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-20","title":"いい映画はいい","content":"\n\n# やったこと\n\n- 過去問\n- メランコリックを見た\n\n[感想](https://scrapbox.io/Dz99/%E3%83%A1%E3%83%A9%E3%83%B3%E3%82%B3%E3%83%AA%E3%83%83%E3%82%AF)。見るのは2回目だけど、前見たときみたいに楽しめたなぁ。大抵はその時のコンディションによって感想が変わるけど、本当に好きな作品はいつ見ても楽しめるんだよな。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-21","title":"1ヶ月もないんだよな","content":"\n\n# やったこと\n\n- 過去問\n- VirtualboxでNixOS動かした。\n\ni3におけるVirtualboxの扱いに結構詰まった。i3ユーザは快適とは言い難いかも。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-22","title":"時間たくさん","content":"\n\n# やったこと\n\n- 過去問\n\nとにかく試験で失敗しないように対策をし続ける毎日。10年近く前の過去門をやってると、問題形式から試験時間まで違う。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-23","title":"図書館いいね","content":"\n\n# やったこと\n\n- 過去問\n- えむじか\n\n図書館がめちゃくちゃ捗る。家でやると寝るか、気づいたらパソコン触ってたりするけど、今日は一気に進めることができた。早く寝ることもできるから最高\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-24","title":"合コン","content":"\n\n# やったこと\n\n- 過去問\n- 研究室\n\n合コンのことしか考えられない。ちゃんと集中しないと。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-25","title":"一歩ずつ","content":"\n\n# やったこと\n\n- 研究室\n- 過去問\n\nプロポーザルを書きながら、少しずつBitVisorと平野研で追加されたシステムを理解していく。楽しいね。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-26","title":"20歳もがんばるぞい","content":"\n\n# やったこと\n\n- 過去問\n- NEW GAME!最終巻まで\n\nNEW GAME!はリアルタイムで追っていたわけではないが、思い出深い作品なのでもう続きがないのは寂しい。明日からもがんばるぞい。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-27","title":"ありがたい","content":"\n\n# やったこと\n\n- 徹底研究復習\n\n# 思ったこと\n\n\nみんなからの誕生日プレゼント嬉しいね。こっから頑張ってやってくぞー\n\n"},{"slug":"2023-05-28","title":"アセンブラがなかったらと考えるとゾッとするよ","content":"\n\n# やったこと\n\n- 課題\n- 徹底研究復習\n- 映画、グッドボーイズ見る\n\n# 思ったこと\n\n\nnaka-chan fuki-non ありがとう。二人のなかたくツールがなかったら普通に死んでる。最高です。\n\n"},{"slug":"2023-05-29","title":"勉強タイム","content":"\n\n# やったこと\n\n- 過去問\n\n最近は図書館で勉強する習慣ができてよい。継続させていきたい。\n\n\n# 思ったこと\n\n"},{"slug":"2023-05-30","title":"コンピュータの行方","content":"\n\n# やったこと\n\n- コンアキ\n- 図書館\n\nとあるアルゴリズム問題のおかげで勉強が進まなかった。明日はがんばるぞい\n\n\n# 思ったこと\n\n\nコンアキでFPGAを動かした時に、命令1行1行がコンピュータの上で走っていくのが感じられて感動した。\n\n"},{"slug":"2023-05-31","title":"Nothing","content":"\n\n# やったこと\n\n- 卒研\n- 過去問\n\n卒研はあんまり進まなくて悲しい。NVMeドライバ謎すぎる。\n\n\nこの日はめっちゃ早く寝てしまった。卒研ある日は疲れるんだよな\n\n\n# 思ったこと\n\n"},{"slug":"2023-06-01","title":"入試","content":"\n\n# やったこと\n\n- 卒研\n- 入試問題\n\n数学の問題にびっくり。専門の問題はTSでいい感じに書けて良かった。\n\n\n# 思ったこと\n\n"},{"slug":"2023-06-02","title":"コーナーケース","content":"\n\n# やったこと\n\n- 入試問題続\n- 卒研\n- 過去問\n\n専門問題でコーナーケースが見つかって困った。ChatGPTが一瞬で解いていて、泣いてしまった。時間使ってしまったけど、面接で聞かれそうなことも一緒に考えれてよかった\n\n\n# 思ったこと\n\n"}]