[{"slug":"2023-01-06","title":"邪悪なフリクリ！","content":"\n\n# やったこと\n\n- フリクリ見る\n- 編入数学 3 章\n- ブログに NIPPO 追加\n\n## フリクリ\n\nついにフリクリを見た！タツキ先生がチェンソーマンについて「邪悪なフリクリ」と言っていたので気になっていたのだが長らく見れていなかった。コミカルな内容とぶっ飛んだ展開とヒロイン、なるほどこれは「ポップなチェンソーマン」だって感じだった。チェンソーマンの Easy revenge タバコの元ネタもフリクリの印象的なシーンとして使われていて興奮した。また最後まで見て大筋のストーリーもかなり似ているのが分かってかなり面白かった。合わせて[このブログ](https://note.com/take_hide/n/na2fbbb15001d)も読みたい。チェンソーマンの話を抜きにしてもカメラの動きやキャラクターの動きが斬新で面白いし、裏で流れている音楽も the pillows というバンドを起用しているらしくゴリゴリのロックって感じで楽しい。今度は鶴巻監督のトップを狙えを見たい。あと JIN-ROH も。\n\n## 編入数学 3 章\n\n広義積分の収束判定が難しい。どうやら収束判定法がいくつかあるらしくどれを使えばよいかがあまり分かっていない。追々定義を確認していきたい。ベータ関数！ガンマ関数！\n\n## ブログに NIPPO 追加\n\n友達が羨ましくて始めた。今あるブログにちょいと変更を加えるだけだったので楽に追加できて良かった（リファクタしたい）。NIPPO の響きが良すぎて気持ち悪い URL や命名になってるけど NIPPO だから許されるはず。映画や本の感想を投稿できるのは楽しい。ついでに[2022 振り返り](https://dz99.me/article/look-back-2022)も書いた。\n\n# 思ったこと\n\nTOEIC のアプリをやりたい。星を継ぐもの読み切りたい。\n"},{"slug":"2023-01-07","title":"もう少しで冬休みが終わる。頼むからあと3日追加してくれ。","content":"\n\n# やったこと\n\n- ブログ OGP 画像を動的に生成\n- 編入数学 3-7 章\n- コンピュータ工学課題\n\n## ブログ OGP 画像を動的に生成\n\nずっとやろうと思っていて後回しになっていた OGP 画像の動的生成をやった。ishibe-chan に教えてもらった@vercel/og を使った。画像を確認しながら開発できたのは良かったが、CSS 弱者としてはデベロッパーツールで Element を確認しながらやりたかった。完成したのはかなり Zenn 亜種ぽくなってしまったけど満足。コードは div だけで構成したり、border のグラデーション表現で background グラデーションを子で上書きすることで実現したりと筋肉コードがあるのでぼちぼち修正したい。\n\n## 編入数学 3-7\n\nなきなき\n\n## コンピュータ工学課題\n\n明日やりたい\n\n# 思ったこと\n\n課題やりたい。イーストウッド映画みたい。\n"},{"slug":"2023-01-08","title":"今はなき遠い故郷へ","content":"\n\n# やったこと\n\n- 人狼 JIN-ROH を見る\n- 星を継ぐものを読む\n\n## 人狼 JIN-ROH を見る\n\nチェンソーマンのレぜ編に影響している作品ということで見た。まさに色濃く影響を与えている作品といった感じで構成が似ていて感動した。改めて人狼とレゼ編を見ると、どちらも「二人で逃げる」くだりがさらに劇的なる。こうした素晴らしい創作アイディアが受け継がれているのを感じると感慨深いものがある :)\n\n## 星を継ぐものを読む\n\n初の SF 小説を読んだ。SF というとスターウォーズを想像するが、この作品はもっと科学や技術に忠実だった。もちろんフィクションなんだけど想像の範囲内というか、「もしかしたらあるかも」というワクワク感を与えてくれる。宇宙服を着た 5 万年前の人類のような生物の謎を解くという内容で、謎が謎を呼んでどんどんと新しい情報と仮説が出て、世界が広がっていく。宇宙への渇望と先祖への感謝感謝が止まらない！\n\n# 思ったこと\n\n家の近くの TSUTAYA がなくなることを知り、ソフトウェアの力を感じた。馴染み深い場所がなくなることは寂しい。日報をスマホで書きたいので、いい感じの仕組みを考えたい。Web で書いて md ファイルをパブリッシュするような？\n"},{"slug":"2023-01-09","title":"ぼざろ8話と12話を見て泣く毎日","content":"\n\n# やったこと\n\n- コンピュータアーキテクチャ課題\n- 解析学課題\n- にんじん読み始め\n\n## コンピュータアーキテクチャ課題\n\n溜まっていた 3 つの課題をやっつけた。正直一気に 3 つはきついので毎週しっかりやっていきたい。うん、当たり前すぎることを言っている。\n\n## 解析学課題\n\nこれからやります :\\_(\n\n## にんじん読み始め\n\nジャンプラで漫 ☆ 画太郎先生が連載中の[漫古 ☆ 知新-バカでも読める古典文学-](https://shonenjumpplus.com/episode/316190247017199335)で題材になっていた本だ。漫 ☆ 画太郎先生のこの漫画は古い本をコミカルに解釈して読んでみようという作品で面白おかしく読めるのだが、題材となっている作品自体はかなりシリアスなものらしいので気になった。また読了後に感想を書きたい。\n\n# 思ったこと\n\n明日から学校なんて信じられない。それでも頑張ろう！\n"},{"slug":"2023-01-10","title":"Never knows best","content":"\n\n# やったこと\n\n- 解析学課題\n- 編入数学\n- 水星の魔女見る\n\n## 解析学課題\n\n重積分は思ったより今までの積み重ね感がある。授業はちゃんと受けよう！\n\n## 編入数学\n\n3 章最後の単元と 4 章の途中まで。定積分と漸化式の範囲は思ったよりできそう。Photomath で解けない問題を人間の脳みそで解くとちょっとうれしい。4 章の定積分を使った面積と体積の計算は意外と覚えてなくて困った。ちゃんと慣れていきたい :)\n\n## 水星の魔女\n\n正月を挟んでやっと 12 話が放映された。最近の水星の魔女は刺激的だったが、1 期の最後ということもあってそれが最高潮に達していた。今まではスレッタの母親の異常性が垣間見えるシーンが多かったが、12 話にしてスレッタの異常性が浮き彫りになった。2 期は 4 月から放映らしいが気になりすぎる。\n\n# 思ったこと\n\n学校があると休みのときより時間をコントロールしやすくなるので良い！早起きが強制されるから？編入勉強を図書館で出来るから？\n"},{"slug":"2023-01-11","title":"スマホで日報を書きたい！","content":"\n\n# やったこと\n\n- スマホで日報やるための調査\n- 茶道\n- 編入数学\n\n## スマホ日報\n\nかねてからスマホで日報を書きたいと思っていて、なんとなく構成を考えていた。Web のエディタで書いてオンラインストレージに md ファイルをポストするようなものを考えていたが、naka-chan に Notion API 使えばいいじゃんと言われて調べてみるとやりたいことが全部満たされていた。1.Notion で記事を書く。2.Notion 記事フェッチ&Markdown ファイル作成。3.変更を見てプルリクを投げる。1~3 のフローで 2,3 はサーバのジョブとして定期実行したい。こんな感じで計画を立てつつ、NotionAPI を叩いたりしていた。\n\n## 茶道\n\n久々のお濃茶のお点前で全然覚えてなくて辛かった。お濃茶は薄茶と違って、一つ一つの所作が重たい＆細かい所作が多いので覚えにくい。お茶会練習がすぐあるので急ピッチでやっていきたい。\n\n## 編入数学\n\n全然できなかった。\n\n# 思ったこと\n\n明日はいい授業\n"},{"slug":"2023-01-12","title":"時間コントロールむずい","content":"\n\n# やったこと\n\n- スマホ日報開発\n- TS パーサコンビネータ\n- 編入数学\n\n## スマホ日報\n\n開発を始めた。とりあえず notion API を使って記事データをフェッチしてファイル作成するとこまでやったので、サーバのジョブとして定期実行させてプルリクを投げるようにしたい。次回で終わらせたいけど actions の知識などがないから時間がかかりそうではある。\n\n## 編入数学\n\n長かった 4 章を抜けて 5 章へ。5 章は級数の範囲だが、結構重たい。無限級数の総和で等比数列を使う問題を解いていて、数列が弱いと感じたので重点的にやっていきたい。\n\n# 思ったこと\n\n本を読みたいんだよぉ\n"},{"slug":"2023-01-13","title":"脊髄剣","content":"\n\n# やったこと\n\n- 新年会第二弾\n- スマホ日報開発\n- チェンソーマン\n\n## 新年会第二弾\n\n新年会第一弾に参加できなかったメンバーを交えて第二弾が開催された。このメンバーたちともうすぐ離れ離れになって、こうして集まるのが難しくなるのは悲しい。一回一回を大事にしたい。\n\n## スマホ日報\n\n新年会が終わったあと actions を書いていたが、いつの間にか寝ていた。今日やろうと思う\n\n# 思ったこと\n\nみんなで集まってあれやこれやと話すのはやっぱり楽しい\n"}]